Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ192GB110.h
#define _CNPU1_CN13PUE_POSITION                  0x0000000D
#define _CNPU1_CN13PUE_MASK                      0x00002000
#define _CNPU1_CN13PUE_LENGTH                    0x00000001

#define _CNPU1_CN14PUE_POSITION                  0x0000000E
#define _CNPU1_CN14PUE_MASK                      0x00004000
#define _CNPU1_CN14PUE_LENGTH                    0x00000001

#define _CNPU1_CN15PUE_POSITION                  0x0000000F
#define _CNPU1_CN15PUE_MASK                      0x00008000
#define _CNPU1_CN15PUE_LENGTH                    0x00000001

#define _CNPU2_CN16PUE_POSITION                  0x00000000
#define _CNPU2_CN16PUE_MASK                      0x00000001
#define _CNPU2_CN16PUE_LENGTH                    0x00000001

#define _CNPU2_CN17PUE_POSITION                  0x00000001
#define _CNPU2_CN17PUE_MASK                      0x00000002
#define _CNPU2_CN17PUE_LENGTH                    0x00000001

#define _CNPU2_CN18PUE_POSITION                  0x00000002
#define _CNPU2_CN18PUE_MASK                      0x00000004
#define _CNPU2_CN18PUE_LENGTH                    0x00000001

#define _CNPU2_CN19PUE_POSITION                  0x00000003
#define _CNPU2_CN19PUE_MASK                      0x00000008
#define _CNPU2_CN19PUE_LENGTH                    0x00000001

#define _CNPU2_CN20PUE_POSITION                  0x00000004
#define _CNPU2_CN20PUE_MASK                      0x00000010
#define _CNPU2_CN20PUE_LENGTH                    0x00000001

#define _CNPU2_CN21PUE_POSITION                  0x00000005
#define _CNPU2_CN21PUE_MASK                      0x00000020
#define _CNPU2_CN21PUE_LENGTH                    0x00000001

#define _CNPU2_CN22PUE_POSITION                  0x00000006
#define _CNPU2_CN22PUE_MASK                      0x00000040
#define _CNPU2_CN22PUE_LENGTH                    0x00000001

#define _CNPU2_CN23PUE_POSITION                  0x00000007
#define _CNPU2_CN23PUE_MASK                      0x00000080
#define _CNPU2_CN23PUE_LENGTH                    0x00000001

#define _CNPU2_CN24PUE_POSITION                  0x00000008
#define _CNPU2_CN24PUE_MASK                      0x00000100
#define _CNPU2_CN24PUE_LENGTH                    0x00000001

#define _CNPU2_CN25PUE_POSITION                  0x00000009
#define _CNPU2_CN25PUE_MASK                      0x00000200
#define _CNPU2_CN25PUE_LENGTH                    0x00000001

#define _CNPU2_CN26PUE_POSITION                  0x0000000A
#define _CNPU2_CN26PUE_MASK                      0x00000400
#define _CNPU2_CN26PUE_LENGTH                    0x00000001

#define _CNPU2_CN27PUE_POSITION                  0x0000000B
#define _CNPU2_CN27PUE_MASK                      0x00000800
#define _CNPU2_CN27PUE_LENGTH                    0x00000001

#define _CNPU2_CN28PUE_POSITION                  0x0000000C
#define _CNPU2_CN28PUE_MASK                      0x00001000
#define _CNPU2_CN28PUE_LENGTH                    0x00000001

#define _CNPU2_CN29PUE_POSITION                  0x0000000D
#define _CNPU2_CN29PUE_MASK                      0x00002000
#define _CNPU2_CN29PUE_LENGTH                    0x00000001

#define _CNPU2_CN30PUE_POSITION                  0x0000000E
#define _CNPU2_CN30PUE_MASK                      0x00004000
#define _CNPU2_CN30PUE_LENGTH                    0x00000001

#define _CNPU2_CN31PUE_POSITION                  0x0000000F
#define _CNPU2_CN31PUE_MASK                      0x00008000
#define _CNPU2_CN31PUE_LENGTH                    0x00000001

#define _CNPU3_CN32PUE_POSITION                  0x00000000
#define _CNPU3_CN32PUE_MASK                      0x00000001
#define _CNPU3_CN32PUE_LENGTH                    0x00000001

#define _CNPU3_CN33PUE_POSITION                  0x00000001
#define _CNPU3_CN33PUE_MASK                      0x00000002
#define _CNPU3_CN33PUE_LENGTH                    0x00000001

#define _CNPU3_CN34PUE_POSITION                  0x00000002
#define _CNPU3_CN34PUE_MASK                      0x00000004
#define _CNPU3_CN34PUE_LENGTH                    0x00000001

#define _CNPU3_CN35PUE_POSITION                  0x00000003
#define _CNPU3_CN35PUE_MASK                      0x00000008
#define _CNPU3_CN35PUE_LENGTH                    0x00000001

#define _CNPU3_CN36PUE_POSITION                  0x00000004
#define _CNPU3_CN36PUE_MASK                      0x00000010
#define _CNPU3_CN36PUE_LENGTH                    0x00000001

#define _CNPU3_CN37PUE_POSITION                  0x00000005
#define _CNPU3_CN37PUE_MASK                      0x00000020
#define _CNPU3_CN37PUE_LENGTH                    0x00000001

#define _CNPU3_CN38PUE_POSITION                  0x00000006
#define _CNPU3_CN38PUE_MASK                      0x00000040
#define _CNPU3_CN38PUE_LENGTH                    0x00000001

#define _CNPU3_CN39PUE_POSITION                  0x00000007
#define _CNPU3_CN39PUE_MASK                      0x00000080
#define _CNPU3_CN39PUE_LENGTH                    0x00000001

#define _CNPU3_CN40PUE_POSITION                  0x00000008
#define _CNPU3_CN40PUE_MASK                      0x00000100
#define _CNPU3_CN40PUE_LENGTH                    0x00000001

#define _CNPU3_CN41PUE_POSITION                  0x00000009
#define _CNPU3_CN41PUE_MASK                      0x00000200
#define _CNPU3_CN41PUE_LENGTH                    0x00000001

#define _CNPU3_CN42PUE_POSITION                  0x0000000A
#define _CNPU3_CN42PUE_MASK                      0x00000400
#define _CNPU3_CN42PUE_LENGTH                    0x00000001

#define _CNPU3_CN43PUE_POSITION                  0x0000000B
#define _CNPU3_CN43PUE_MASK                      0x00000800
#define _CNPU3_CN43PUE_LENGTH                    0x00000001

#define _CNPU3_CN44PUE_POSITION                  0x0000000C
#define _CNPU3_CN44PUE_MASK                      0x00001000
#define _CNPU3_CN44PUE_LENGTH                    0x00000001

#define _CNPU3_CN45PUE_POSITION                  0x0000000D
#define _CNPU3_CN45PUE_MASK                      0x00002000
#define _CNPU3_CN45PUE_LENGTH                    0x00000001

#define _CNPU3_CN46PUE_POSITION                  0x0000000E
#define _CNPU3_CN46PUE_MASK                      0x00004000
#define _CNPU3_CN46PUE_LENGTH                    0x00000001

#define _CNPU3_CN47PUE_POSITION                  0x0000000F
#define _CNPU3_CN47PUE_MASK                      0x00008000
#define _CNPU3_CN47PUE_LENGTH                    0x00000001

